In [5]:
import numpy as np
import pandas as pd

In [6]:
data = {'apples':[3,2,0,6],
         'oranges':[0,3,5,8]}

In [8]:
purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        5
3       6        8

In [10]:
purchases = pd.DataFrame(data,index=['sneha','haripriya','faiyaz','raj'])

purchases

           apples  oranges
sneha           3        0
haripriya       2        3
faiyaz          0        5
raj             6        8

In [ ]:
#req: I want to get the out of what exactly haripriya has purchases....basically I want to locate haririya's purchased?

In [12]:
purchases.loc['haripriya']

apples     2
oranges    3
Name: haripriya, dtype: int64

In [13]:
purchases.iloc[0]

apples     3
oranges    0
Name: sneha, dtype: int64

In [14]:
purchases.iloc[1]

apples     2
oranges    3
Name: haripriya, dtype: int64

In [15]:
purchases.iloc[2]

apples     0
oranges    5
Name: faiyaz, dtype: int64

In [16]:
purchases.iloc[3]

apples     6
oranges    8
Name: raj, dtype: int64

In [ ]:
Interviwq Question: What is the difference between vc loc(naming) and iloc(indexing)

In [ ]:
#reading the data from csv....(comma separated value)

In [ ]:
purchases.csv

In [20]:
df = pd.read_csv('purchases.csv')

df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [ ]:
# To avoid system generated indexing:

In [23]:
df = pd.read_csv('purchases.csv',index_col=0)

df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [ ]:
#Reading the data from JSON:

Javascript object notion ------> key-value pair format (dict)

In [25]:
df = pd.read_json('purchases.json')

df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [ ]:
json ----->csv I want to convert.....!

In [26]:
df.to_csv('new_purchases.csv')

In [27]:
df = pd.read_csv('new_purchases.csv')

df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2